YuYanDev/BGABL-rotate-system/STM32G030-ControlPart/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SPI1_CS_Pin GPIO_PIN_4
#define SPI1_CS_GPIO_Port GPIOA
#define EL_ZERO_SET_Pin GPIO_PIN_13
#define EL_ZERO_SET_GPIO_Port GPIOB
#define AZ_ZERO_SET_Pin GPIO_PIN_14
#define AZ_ZERO_SET_GPIO_Port GPIOB
#define EL_CCW_LED_Pin GPIO_PIN_15
#define EL_CCW_LED_GPIO_Port GPIOB
#define EL_CW_LED_Pin GPIO_PIN_8
#define EL_CW_LED_GPIO_Port GPIOA
#define AZ_CCW_LED_Pin GPIO_PIN_11
#define AZ_CCW_LED_GPIO_Port GPIOA
#define AZ_CW_LED_Pin GPIO_PIN_12
#define AZ_CW_LED_GPIO_Port GPIOA
#define EL_CCW_ENABLE_Pin GPIO_PIN_0
#define EL_CCW_ENABLE_GPIO_Port GPIOD
#define EL_CW_ENABLE_Pin GPIO_PIN_1
#define EL_CW_ENABLE_GPIO_Port GPIOD
#define AZ_CCW_ENABLE_Pin GPIO_PIN_2
#define AZ_CCW_ENABLE_GPIO_Port GPIOD
#define AZ_CW_ENABLE_Pin GPIO_PIN_3
#define AZ_CW_ENABLE_GPIO_Port GPIOD
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
